_posts/php/2018-08-05-learning-php.html
---
title: PHP 程序员升级之路
author: zrg
description: PHP 开发知识体系结构总结
date: 2018-08-05
categories:
- php
tags:
- PHP-Programmer
---

<div id="outline-container-orge2c5943" class="outline-2">
<h2 id="orge2c5943"><span class="section-number-2">1</span> Web 入门</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-orgcfb8d7d" class="outline-3">
<h3 id="orgcfb8d7d"><span class="section-number-3">1.1</span> B/S vs C/S</h3>
<div class="outline-text-3" id="text-1-1">
<p>
B/S：SMS, SNS, WebGame, Wiki, RSS, BLog, 电子商务系统
</p>
</div>
</div>
<div id="outline-container-org0f0c1da" class="outline-3">
<h3 id="org0f0c1da"><span class="section-number-3">1.2</span> Web 2.0</h3>
<div class="outline-text-3" id="text-1-2">
<p>
Web1.0-&gt;Web2.0-&gt;Web3.0（Microsoft，站内信可以直接和其他网站进行交换和互动）-&gt;Web4.0（Eg. 聚餐吃饭情形，实现资源共享）
</p>

<p>
网页设计发展阶段:table-&gt;table+css-&gt;div+css
</p>
</div>
</div>

<div id="outline-container-org6731b34" class="outline-3">
<h3 id="org6731b34"><span class="section-number-3">1.3</span> 脚本语言和主流 Web 应用开发平台</h3>
<div class="outline-text-3" id="text-1-3">
<p>
脚本语言：PHP, HTML, CSS, JavaScript, VBScript, ActionScript, ASP, JSP, SQL, Perl, Python, Ruby, JavaFx, Lua, AutoIt, &#x2026;
</p>
<ul class="org-ul">
<li>Asp.Net</li>
<li>JavaEE</li>
<li>LAMP</li>
</ul>
</div>
</div>

<div id="outline-container-orgc730455" class="outline-3">
<h3 id="orgc730455"><span class="section-number-3">1.4</span> HTTP（HyperText Transfer Protocol）</h3>
<div class="outline-text-3" id="text-1-4">
</div>
<div id="outline-container-org2539d94" class="outline-4">
<h4 id="org2539d94"><span class="section-number-4">1.4.1</span> 工作过程：</h4>
<div class="outline-text-4" id="text-1-4-1">
<ol class="org-ol">
<li>客户端连接到 Web Server</li>
<li>发送 HTTP 请求</li>
<li>服务器接收到请求并返回 HTTP 响应</li>
<li>释放 TCP 连接</li>
<li>客户端解析 HTML 内容</li>
</ol>
</div>
</div>

<div id="outline-container-org04ecdf7" class="outline-4">
<h4 id="org04ecdf7"><span class="section-number-4">1.4.2</span> HTTP Request Header</h4>
<div class="outline-text-4" id="text-1-4-2">
<p>
请求行（头部行）：请求方法，URL，HTTP 版本
</p>
</div>
</div>

<div id="outline-container-org7d88d6c" class="outline-4">
<h4 id="org7d88d6c"><span class="section-number-4">1.4.3</span> HTTP Response Header</h4>
<div class="outline-text-4" id="text-1-4-3">
<p>
协议版本，状态码，原因短语
content-length:
content-type: text/html
</p>
</div>
</div>

<div id="outline-container-org2ae5cfd" class="outline-4">
<h4 id="org2ae5cfd"><span class="section-number-4">1.4.4</span> 常见的状态码</h4>
<div class="outline-text-4" id="text-1-4-4">
<ol class="org-ol">
<li>200</li>
<li>301</li>
<li>400</li>
<li>500</li>
<li>502</li>
</ol>
</div>
</div>

<div id="outline-container-org79dc0d2" class="outline-4">
<h4 id="org79dc0d2"><span class="section-number-4">1.4.5</span> URL vs URI</h4>
<div class="outline-text-4" id="text-1-4-5">
<p>
URL(Uniform Resource Locator，统一资源定位符)
URI(Uniform Resource Identifier，统一资源标识符)，用于标识互联网资源名称的字符串，常见形式就是 URL，另外还有一个叫 URN(Uniform Resource Name，统一资源名称)，通俗地说，URL 和 URN 是 URI 的子集，URI 属于更高层次的抽象。
</p>
</div>
</div>

<div id="outline-container-orgb7a892a" class="outline-4">
<h4 id="orgb7a892a"><span class="section-number-4">1.4.6</span> Web 工作原理</h4>
<div class="outline-text-4" id="text-1-4-6">
<p>
&gt; 当用户打开浏览器，输入一个 URL，按下回车键，请大致描述发生的所有事件。
</p>
</div>
</div>
</div>

<div id="outline-container-orgb22071c" class="outline-3">
<h3 id="orgb22071c"><span class="section-number-3">1.5</span> HTML5 &amp; CSS3</h3>
<div class="outline-text-3" id="text-1-5">
</div>
<div id="outline-container-orgad31e44" class="outline-4">
<h4 id="orgad31e44"><span class="section-number-4">1.5.1</span> HTML5</h4>
<div class="outline-text-4" id="text-1-5-1">
<ol class="org-ol">
<li><p>
新变化
</p>

<p>
```html
&lt;!&#x2013; 声明 &#x2013;&gt;
&lt;!DOCTYPE html&gt;
&lt;!&#x2013; 编码 &#x2013;&gt;
&lt;meta charset="UTF-8"&gt;
&lt;!&#x2013; 具有 boolean 属性 &#x2013;&gt;
&lt;input type="text" disabled="false" readonly="true" /&gt;
&lt;!&#x2013; 新增结构元素、表单属性、多媒体属性、其他元素 &#x2013;&gt;
&lt;header&gt;&lt;/header&gt;
&lt;section&gt;&lt;/section&gt;
&lt;aside&gt;&lt;/aside&gt;
&lt;footer&gt;&lt;footer&gt;
```
</p></li>
<li>高级功能：

<ul class="org-ul">
<li>绘制图形，如签名</li>
<li>本地存储和离线应用：本地存储分为 Web Storage(原 HTML 4 中扩展)和本地 DB(HTML5 新增)</li>
<li>通信 API：两种方式：跨文档消息传输和 Web Sockets API。解决了同源通信和跨域通信，同时 Server 不再需要被动的等待 Client 发出请求，只要两端建立连接后，Server 端就可以主动推送数据给 Client 端。</li>
<li>处理线程：在 HTML4 和 JS 编写程序时，所有的处理都是单线程内执行，话费时间比较长。HTML5 新增 Web Workers API，可以容易地在后台创建线程，并且这个后台线程还能创建多个子线程。</li>
<li>获取地理位置</li>
</ul></li>
</ol>
</div>
</div>

<div id="outline-container-org97f20ab" class="outline-4">
<h4 id="org97f20ab"><span class="section-number-4">1.5.2</span> CSS3</h4>
<div class="outline-text-4" id="text-1-5-2">
<p>
圆角、多背景、3D 动画、渐变、阴影效果、透明度、……
</p>
</div>
</div>

<div id="outline-container-org3c0e6d6" class="outline-4">
<h4 id="org3c0e6d6"><span class="section-number-4">1.5.3</span> Less CSS 框架</h4>
</div>
</div>

<div id="outline-container-orgc8297a5" class="outline-3">
<h3 id="orgc8297a5"><span class="section-number-3">1.6</span> 主流前端技术</h3>
<div class="outline-text-3" id="text-1-6">
</div>
<div id="outline-container-org4a1f27f" class="outline-4">
<h4 id="org4a1f27f"><span class="section-number-4">1.6.1</span> BootStrap</h4>
</div>

<div id="outline-container-org00e8c8e" class="outline-4">
<h4 id="org00e8c8e"><span class="section-number-4">1.6.2</span> Jquery</h4>
</div>

<div id="outline-container-orge92bba5" class="outline-4">
<h4 id="orge92bba5"><span class="section-number-4">1.6.3</span> VueJS</h4>
</div>
</div>
</div>

<div id="outline-container-orgc5a85a3" class="outline-2">
<h2 id="orgc5a85a3"><span class="section-number-2">2</span> PHP 基础</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-orgcbeb2f6" class="outline-3">
<h3 id="orgcbeb2f6"><span class="section-number-3">2.1</span> PHP 学习导向</h3>
<div class="outline-text-3" id="text-2-1">
<ol class="org-ol">
<li>确定学习目标</li>
<li>坚持动手实践</li>
<li>以解决事情为先</li>
<li>学习路线图</li>
</ol>
</div>
</div>

<div id="outline-container-org0b99ae8" class="outline-3">
<h3 id="org0b99ae8"><span class="section-number-3">2.2</span> 搭建 PHP 环境</h3>
<div class="outline-text-3" id="text-2-2">
</div>
<div id="outline-container-org2a895cd" class="outline-4">
<h4 id="org2a895cd"><span class="section-number-4">2.2.1</span> Linux 下源码安装</h4>
</div>

<div id="outline-container-orgf885bed" class="outline-4">
<h4 id="orgf885bed"><span class="section-number-4">2.2.2</span> Windows 下 WampServer 集成包安装</h4>
<div class="outline-text-4" id="text-2-2-2">
<ol class="org-ol">
<li>安装准备</li>
<li>安装步骤</li>
<li>环境测试</li>
<li>常见配置
<ul class="org-ul">
<li>改变 www 目录位置</li>
<li>phpMyAdmin管理</li>
</ul></li>
</ol>
</div>
</div>
</div>

<div id="outline-container-orge03daa0" class="outline-3">
<h3 id="orge03daa0"><span class="section-number-3">2.3</span> PHP 基本语法</h3>
<div class="outline-text-3" id="text-2-3">
</div>
<div id="outline-container-org33650ce" class="outline-4">
<h4 id="org33650ce"><span class="section-number-4">2.3.1</span> 基本语法结构</h4>
</div>

<div id="outline-container-org6ad69a6" class="outline-4">
<h4 id="org6ad69a6"><span class="section-number-4">2.3.2</span> 注释 &amp; 指令分隔副符</h4>
</div>

<div id="outline-container-org66ced82" class="outline-4">
<h4 id="org66ced82"><span class="section-number-4">2.3.3</span> 变量及变量数据类型、数据类型转换</h4>
</div>

<div id="outline-container-org2185222" class="outline-4">
<h4 id="org2185222"><span class="section-number-4">2.3.4</span> 函数</h4>
</div>

<div id="outline-container-org55ec194" class="outline-4">
<h4 id="org55ec194"><span class="section-number-4">2.3.5</span> 运算符和表达式</h4>
</div>

<div id="outline-container-org5834455" class="outline-4">
<h4 id="org5834455"><span class="section-number-4">2.3.6</span> 流程控制</h4>
</div>

<div id="outline-container-org0dbe2ec" class="outline-4">
<h4 id="org0dbe2ec"><span class="section-number-4">2.3.7</span> 函数的应用</h4>
<div class="outline-text-4" id="text-2-3-7">
<ol class="org-ol">
<li>自定义函数</li>
<li>内置函数</li>
<li>递归函数</li>
<li>匿名函数(闭包函数)</li>
</ol>
</div>
</div>
</div>

<div id="outline-container-org2d92536" class="outline-3">
<h3 id="org2d92536"><span class="section-number-3">2.4</span> PHP Array</h3>
<div class="outline-text-3" id="text-2-4">
</div>
<div id="outline-container-org0189fd4" class="outline-4">
<h4 id="org0189fd4"><span class="section-number-4">2.4.1</span> foreach &amp; list &amp; each &amp; while &amp; for</h4>
</div>
<div id="outline-container-org162f652" class="outline-4">
<h4 id="org162f652"><span class="section-number-4">2.4.2</span> 数组的内部指针：</h4>
<div class="outline-text-4" id="text-2-4-2">
<ol class="org-ol">
<li>current()</li>
<li>key()</li>
<li>next()</li>
<li>prev()</li>
<li>end()</li>
<li>reset()</li>
</ol>
</div>
</div>

<div id="outline-container-org33abd8a" class="outline-4">
<h4 id="org33abd8a"><span class="section-number-4">2.4.3</span> 预定义 Array</h4>
<div class="outline-text-4" id="text-2-4-3">
<ol class="org-ol">
<li>$_SERVER</li>
<li>$_GET</li>
<li>$_POST</li>
<li>&#x2026;</li>
</ol>
</div>
</div>

<div id="outline-container-orgf5dc28a" class="outline-4">
<h4 id="orgf5dc28a"><span class="section-number-4">2.4.4</span> Array 操作函数</h4>
</div>

<div id="outline-container-orgd5c912b" class="outline-4">
<h4 id="orgd5c912b"><span class="section-number-4">2.4.5</span> 注意事项</h4>
<div class="outline-text-4" id="text-2-4-5">
<ul class="org-ul">
<li>”+“可以把两个数组合并，与 Array_merget() 作用差不多，只是它会去除重复的键值</li>
<li>两个 Array 存在相同的 Key、Value可以使用运算符比较</li>
<li>删除 Array 元素，使用 unset，但不会重建数组索引</li>
<li>Array 下标只能是 int 和 string</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org8dfce40" class="outline-3">
<h3 id="org8dfce40"><span class="section-number-3">2.5</span> PHP String</h3>
<div class="outline-text-3" id="text-2-5">
</div>
<div id="outline-container-orgcbf854f" class="outline-4">
<h4 id="orgcbf854f"><span class="section-number-4">2.5.1</span> 常见问题</h4>
<div class="outline-text-4" id="text-2-5-1">
<ol class="org-ol">
<li>单引号和双引号的区别</li>
<li>echo &amp; print &amp; var_dump &amp; die &amp; printf &amp; sprintf</li>
</ol>
</div>
</div>
<div id="outline-container-org399e59c" class="outline-4">
<h4 id="org399e59c"><span class="section-number-4">2.5.2</span> 常用字符串函数</h4>
</div>
</div>
<div id="outline-container-org9b6299d" class="outline-3">
<h3 id="org9b6299d"><span class="section-number-3">2.6</span> PHP Date and Time</h3>
</div>
<div id="outline-container-orga4bd82e" class="outline-3">
<h3 id="orga4bd82e"><span class="section-number-3">2.7</span> PHP File</h3>
<div class="outline-text-3" id="text-2-7">
</div>
<div id="outline-container-orgc75c034" class="outline-4">
<h4 id="orgc75c034"><span class="section-number-4">2.7.1</span> 文件或目录基本操作</h4>
</div>
<div id="outline-container-orga39ede5" class="outline-4">
<h4 id="orga39ede5"><span class="section-number-4">2.7.2</span> 设计经典的文件上传和下载类</h4>
</div>
</div>
<div id="outline-container-org7a29f4c" class="outline-3">
<h3 id="org7a29f4c"><span class="section-number-3">2.8</span> PHP 动态图像处理</h3>
<div class="outline-text-3" id="text-2-8">
</div>
<div id="outline-container-org257c67f" class="outline-4">
<h4 id="org257c67f"><span class="section-number-4">2.8.1</span> PHP GD 库的使用</h4>
</div>
<div id="outline-container-org7aa4db0" class="outline-4">
<h4 id="org7aa4db0"><span class="section-number-4">2.8.2</span> 设计经典的验证码类</h4>
</div>
<div id="outline-container-org672f0d0" class="outline-4">
<h4 id="org672f0d0"><span class="section-number-4">2.8.3</span> 设计经典的图像处理类</h4>
</div>
</div>
<div id="outline-container-org4fc112b" class="outline-3">
<h3 id="org4fc112b"><span class="section-number-3">2.9</span> 正则表达式</h3>
<div class="outline-text-3" id="text-2-9">
</div>
<div id="outline-container-org519b5ac" class="outline-4">
<h4 id="org519b5ac"><span class="section-number-4">2.9.1</span> 正则表达式语法规则</h4>
</div>
<div id="outline-container-org668b4ba" class="outline-4">
<h4 id="org668b4ba"><span class="section-number-4">2.9.2</span> PHP 的正则表达式函数</h4>
</div>
</div>
<div id="outline-container-org716c850" class="outline-3">
<h3 id="org716c850"><span class="section-number-3">2.10</span> 面向对象</h3>
<div class="outline-text-3" id="text-2-10">
</div>
<div id="outline-container-orge36b9a7" class="outline-4">
<h4 id="orge36b9a7"><span class="section-number-4">2.10.1</span> 类</h4>
</div>
<div id="outline-container-orgdd9e47c" class="outline-4">
<h4 id="orgdd9e47c"><span class="section-number-4">2.10.2</span> 对象</h4>
<div class="outline-text-4" id="text-2-10-2">
<ol class="org-ol">
<li>对象类型在内存中的分配：
<ul class="org-ul">
<li>栈</li>
<li>堆</li>
<li>静态区</li>
<li>代码段</li>
</ul></li>
<li>面向对象三特性
<ul class="org-ul">
<li>封装</li>
<li>继承</li>
<li>多态：最直接的定义就是让具有继承关系的不同类，可以对相同的成员方法进行调用，产生不同的效果。</li>
</ul></li>
</ol>
</div>
</div>
<div id="outline-container-orgbfd40cb" class="outline-4">
<h4 id="orgbfd40cb"><span class="section-number-4">2.10.3</span> 抽象方法</h4>
</div>
<div id="outline-container-orgef2757a" class="outline-4">
<h4 id="orgef2757a"><span class="section-number-4">2.10.4</span> 接口</h4>
</div>
<div id="outline-container-org144869a" class="outline-4">
<h4 id="org144869a"><span class="section-number-4">2.10.5</span> 常见的关键字和魔术方法</h4>
<div class="outline-text-4" id="text-2-10-5">
<ol class="org-ol">
<li>final</li>
<li>static</li>
<li>const</li>
<li>instanceOf</li>
<li>单态设计模式</li>
<li>克隆对象</li>
<li>__toString()</li>
<li>__call()</li>
<li>自动加载类</li>
<li>对象序列化</li>
</ol>
</div>
</div>
<div id="outline-container-orga352fc7" class="outline-4">
<h4 id="orga352fc7"><span class="section-number-4">2.10.6</span> PHP 新特性</h4>
<div class="outline-text-4" id="text-2-10-6">
<ol class="org-ol">
<li>trait</li>
<li>命名空间</li>
</ol>
</div>
</div>
</div>

<div id="outline-container-org958dec2" class="outline-3">
<h3 id="org958dec2"><span class="section-number-3">2.11</span> PHP Errors and Exceptions</h3>
<div class="outline-text-3" id="text-2-11">
</div>
<div id="outline-container-org4fbcce7" class="outline-4">
<h4 id="org4fbcce7"><span class="section-number-4">2.11.1</span> 错误报告级别</h4>
</div>
<div id="outline-container-orgbec04c1" class="outline-4">
<h4 id="orgbec04c1"><span class="section-number-4">2.11.2</span> 异常处理及扩展 PHP 内置的异常处理类</h4>
</div>
</div>
<div id="outline-container-org2c40513" class="outline-3">
<h3 id="org2c40513"><span class="section-number-3">2.12</span> PHP 访问 MySQL</h3>
<div class="outline-text-3" id="text-2-12">
</div>
<div id="outline-container-orge501ab3" class="outline-4">
<h4 id="orge501ab3"><span class="section-number-4">2.12.1</span> 设计完美的分页类</h4>
</div>
<div id="outline-container-org8891f1a" class="outline-4">
<h4 id="org8891f1a"><span class="section-number-4">2.12.2</span> 数据库抽象层 PDO</h4>
<div class="outline-text-4" id="text-2-12-2">
<ol class="org-ol">
<li>创建和使用 PDO 对象</li>
<li>PDO 的事物处理</li>
</ol>
</div>
</div>
</div>
</div>
<div id="outline-container-org629be2c" class="outline-2">
<h2 id="org629be2c"><span class="section-number-2">3</span> PHP 高级篇</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-orgc67e037" class="outline-3">
<h3 id="orgc67e037"><span class="section-number-3">3.1</span> Memcache</h3>
</div>
<div id="outline-container-org1aad566" class="outline-3">
<h3 id="org1aad566"><span class="section-number-3">3.2</span> Redis</h3>
</div>
<div id="outline-container-org98eb36a" class="outline-3">
<h3 id="org98eb36a"><span class="section-number-3">3.3</span> 会话控制</h3>
<div class="outline-text-3" id="text-3-3">
</div>
<div id="outline-container-orgcb68c02" class="outline-4">
<h4 id="orgcb68c02"><span class="section-number-4">3.3.1</span> Cookie</h4>
</div>
<div id="outline-container-orgc44f0d1" class="outline-4">
<h4 id="orgc44f0d1"><span class="section-number-4">3.3.2</span> Session</h4>
</div>
</div>
<div id="outline-container-org1e0c07d" class="outline-3">
<h3 id="org1e0c07d"><span class="section-number-3">3.4</span> PHP 的 CURL 扩展模块</h3>
</div>
<div id="outline-container-org23e1ab4" class="outline-3">
<h3 id="org23e1ab4"><span class="section-number-3">3.5</span> Smarty</h3>
<div class="outline-text-3" id="text-3-5">
</div>
<div id="outline-container-org6163129" class="outline-4">
<h4 id="org6163129"><span class="section-number-4">3.5.1</span> 什么是模板引擎</h4>
</div>
<div id="outline-container-orgee9dc01" class="outline-4">
<h4 id="orgee9dc01"><span class="section-number-4">3.5.2</span> 安装及使用 Smarty</h4>
</div>
<div id="outline-container-orgfd0420b" class="outline-4">
<h4 id="orgfd0420b"><span class="section-number-4">3.5.3</span> Smarty 的缓存控制</h4>
</div>
</div>
<div id="outline-container-org8750252" class="outline-3">
<h3 id="org8750252"><span class="section-number-3">3.6</span> MVC 架构思想</h3>
</div>
<div id="outline-container-org877bc2c" class="outline-3">
<h3 id="org877bc2c"><span class="section-number-3">3.7</span> 项目开发</h3>
<div class="outline-text-3" id="text-3-7">
</div>
<div id="outline-container-org0023926" class="outline-4">
<h4 id="org0023926"><span class="section-number-4">3.7.1</span> B/S 结构软件开发流程</h4>
<div class="outline-text-4" id="text-3-7-1">
<ol class="org-ol">
<li>软件</li>
</ol>
</div>
</div>
<div id="outline-container-orge4935a0" class="outline-4">
<h4 id="orge4935a0"><span class="section-number-4">3.7.2</span> 示例:电子商城系统需求分析说明书</h4>
</div>
</div>
</div>
<div id="outline-container-org3ae41ca" class="outline-2">
<h2 id="org3ae41ca"><span class="section-number-2">4</span> 其他</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-org1ef1ba5" class="outline-3">
<h3 id="org1ef1ba5"><span class="section-number-3">4.1</span> 编码规范</h3>
<div class="outline-text-3" id="text-4-1">
</div>
<div id="outline-container-org898e038" class="outline-4">
<h4 id="org898e038"><span class="section-number-4">4.1.1</span> 适用范围</h4>
</div>
<div id="outline-container-org5c59044" class="outline-4">
<h4 id="org5c59044"><span class="section-number-4">4.1.2</span> 目标</h4>
</div>
<div id="outline-container-orgf083b75" class="outline-4">
<h4 id="orgf083b75"><span class="section-number-4">4.1.3</span> 开发工具</h4>
</div>
<div id="outline-container-org49566a3" class="outline-4">
<h4 id="org49566a3"><span class="section-number-4">4.1.4</span> PHP 的文件格式</h4>
</div>
<div id="outline-container-org60ec983" class="outline-4">
<h4 id="org60ec983"><span class="section-number-4">4.1.5</span> MySQL 的设计规范</h4>
</div>
</div>
<div id="outline-container-org284224b" class="outline-3">
<h3 id="org284224b"><span class="section-number-3">4.2</span> PHP 的安全和优化</h3>
<div class="outline-text-3" id="text-4-2">
</div>
<div id="outline-container-orgd7c86e7" class="outline-4">
<h4 id="orgd7c86e7"><span class="section-number-4">4.2.1</span> 网络安全(Security)</h4>
</div>
<div id="outline-container-orgfd27267" class="outline-4">
<h4 id="orgfd27267"><span class="section-number-4">4.2.2</span> 网站优化(Optimize)</h4>
</div>
</div>
</div>
